{

    "Header.Item1" : "About me",
    "Header.Item2" : "Experience",
    "Header.Item3" : "Projects",
    "Header.Item4" : "Contact",
    "Header.cvBtn" : "Resume",
    "Header.cvName": "Aniket_Joshi_FullStack_Net_Developer.pdf",

    "Banner.Pretitle": "Hello! My name is",
    "Banner.Description": "I have  <span class='underline'>1.5 years of experience</span> in  developing REST API's using ASP.NET Core API & MVC, Angular to make the web a better place. I am dedicated to writing and refactoring clean, reusable, and scalable code in <span class='underline'>Angular</span> and  <span class='underline'>ASP.NET</span> applying good practices and development standards.",
    "Banner.ActionBtn": "Get in touch",

    "AboutMe.Title": "About me",
   "AboutMe.Paragraphs": [
  "Hi there! I’m Aniket Joshi, a Full Stack .NET Developer who loves bringing ideas to life with clean code, powerful APIs, and pixel-perfect Angular interfaces. With 1.5+ years of hands-on experience, I’ve built and deployed secure, scalable applications that don’t just work—they wow.\n\nWhile I speak fluent C#, TypeScript, and SQL, I’m also learning to listen to what systems aren’t saying—because I’m diving deep into cybersecurity. I enjoy breaking things in labs (ethically, of course) just to understand how to make them stronger in real life.\n\nI believe great software isn’t just built—it’s secured, streamlined, and made with intention. Whether it’s CI/CD pipelines in Azure or tracking down vulnerabilities, I’m all about building tech that performs and protects.\n\nLet’s build something great—and secure—together."
],


 
    "Experience.Title": "Experience",
    "Experience.Jobs": [     
               {
            "Tab":"Decisivedge LLC.",
            "Title": "Junior Dotnet developer",
            "Date": "April 2025 - July 2025",
            "Description":[
                "Developed and maintained enterprise-grade modules using .NET and Angular as part of an agile delivery team.",
                "Collaborated with cross-functional teams to address UAT bugs and support client-facing deliverables.",
                "Engagement ended post-probation due to internal project restructuring and prioritization shifts."
            ]
        },
        {
            "Tab":"ThinkAI Corporation Pvt Ltd.",
            "Title": "Dotnet developer",
            "Date": "March 2024 - February 2025",
            "Description":[
                "Optimized deployment processes by integrating automated CI/CD pipelines to multiple environments ,improving deployment speed by 50%.",
                "Developed and led the development of Kousa's shipping management platform, utilizing .NET 7 and Angular.",
                "Enabled real-time tracking and management of container shipments across global supply chains.",
                "Implemented robust security measures, including Azure AD B2C authentication and encrypted storage for sensitive shipping documents."
            ]
        }, 
        {
            "Tab":"SSK TechMetrics Pvt Ltd.",
            "Title": "Fullstack .Net developer",
            "Date": "December 2023 - September 2023",
            "Description":[
                "Collaborated with senior developers to design and implement responsive and visually appealing user interfaces using HTML, CSS, and JavaScript.",
                "Developed efficient and maintainable back-end components using C# and the .NET framework, ensuring seamless integration with front-end functionalities.",
                "Actively participated in code reviews, providing constructive feedback and implementing suggested improvements to enhance the overall code quality.",
                "Contributed to the development of RESTful APIs to facilitate smooth communication between the front-end and back-end systems."
            ]
        }, 
        {
            "Tab": "Feedough.Com",
            "Title": "Fullstack Javascript developer",
            "Date": "March 2022 - June 2022",
            "Description": [
              "Creation and Implementation of features to detect Plagarism  and Trending topic for blogging.",
              "Creation of automated text generation for specified topic name using AI.",
              "Collaborated with the Team of Developers to write clean and robust code.",
              "Planning and implementing features according to the product team.",
              "Tech Stack: Angular,HTML,CSS, Node ,MongoDb, Git,Github,"
            ]
        }
    ],

    "FeatureProjects.Title": "My projects",
    "FeatureProjects.Label": "Featured Project",
    "FeatureProjects.Projects": [
        {
            "Title": "CryptoSteller",
            "Description": "A Crypto Currency app , <span class='underline'>with realtime weather by city names</span>. It tracks realtime crypto currency prices and their exchange rates with USD .",
            "imgs": [
                "assets/images/cryptosteller-weather.png",
                "assets/images/cryptostelller-news.png",
                "assets/images/cryptostelller-prices.png"
            ],
            "Technologies": ["Html", "Angular", "Asp.Net API","CSS", "Angular Material", "RxJS","Bootstrap"] 
        },
        {
            "Title": "ECourtFlow",
            "Description": "A <span class='underline'> Differentiated Case Flow Management (DCM) </span>  system designed to streamline and optimize legal workflows. It provides tailored dashboards for administrators, clerks, and judges to enhance operational efficiency within legal institutions.",
            "imgs": [
                "assets/images/ecourtflow-homepage.png",
                "assets/images/ecourtflow-types.png",
                "assets/images/ecourtflow-faqs.png"
            ],
            "Technologies": ["Html", "Angular", "Node JS","CSS", "Angular Material", "Firebase","MongoDB"] 
        } 
      
        
    ],



    "OtherProjects.Title": "More projects",
    "OtherProjects.Projects": [{
            "Title": "ECourtFlow",
            "Description": "ECourtflow is a dynamic judiciary management system for both advocates and judges to reduce unnecessary delay from hearing and smooth delievering of justice.",
            "ghLink": "https://github.com/aniket811/eCourtFlow.git",
            "demoLink": "https://hackathon-n2ci.vercel.app/",
            "Technologies": ["Angular","Angular Material", "RxJs", "API", "Bootstrap","Node JS","Mongo DB"]
        },
        {
            "Title": "SocialShare",
            "Description": "The platform fosters a collaborative environment where the collective knowledge of the community can be leveraged to troubleshoot and overcome coding challenges.             ",
            "ghLink": "https://github.com/aniket811/socialshare.git",
            "demoLink": "https://socialshare-29eab.web.app/",
            "Technologies": ["Angular","Firebase","Firestore", "SASS", "CSS GRID", "Reactive form"]
        }
    
    ],
    "Contact.Pretitle": "What’s Next",
    "Contact.Title": "Get in touch!",
    "Contact.Content": "I will be happy to receive your contact if you want to talk about new opportunities. Write me, and I will reply as soon as I see your message. ",
    "Contact.Btn": "Say Hello"


}
